{
    "description": "Enable S3 Block Public Access for S3 Buckets",
    "rationale": "Ensure that Amazon S3 public access is blocked at the S3 bucket level for data protection. Ensure that Amazon S3 Block Public Access feature is enabled for your S3 buckets to restrict public access to all objects available within these buckets, including those that you upload in the future. In order to enable Amazon S3 Block Public Access for your S3 buckets, you must turn on the following settings:\n1. Block new public ACLs and uploading public objects (BlockPublicAcls) – this setting disallows the use of new public buckets or object Access Control Lists (ACLs) and it is usually used to ensure that future PUT requests that include them will fail. Enable this setting to protect against future attempts to use ACLs to make S3 buckets or objects publicly available.\n\n2. Remove public access granted through public ACLs (IgnorePublicAcls) – this setting instructs the S3 service to stop evaluating any public ACL when authorizing a request, ensuring that no bucket or object can be made public by using Access Control Lists (ACLs). This option overrides any current or future public access settings for current and future objects in the configured S3 bucket.\n\n3. Block new public bucket policies (BlockPublicPolicy) – this option disallows the use of new public bucket policies. This setting ensures that an S3 bucket policies cannot be updated to grant public access.\n\n4. Block public and cross-account access to buckets that have public policies (RestrictPublicBuckets) – once this option is enabled, the access to those S3 buckets that are publicly accessible will be limited to the bucket owner and to AWS services. This setting can be used to protect S3 buckets that have public policies while you work to remove the policies. By default, this conformity rule checks for all four settings (as recommended by AWS) in order to determine whether the feature is enabled for the specified bucket. However, you can customize the rule configuration by enabling/disabling these settings within your Cloud Conformity account.",
    "references": [
        "https://www.cloudconformity.com/knowledge-base/aws/S3/bucket-public-access-block.html",
        "https://aws.amazon.com/s3/faqs/",
        "https://docs.aws.amazon.com/AmazonS3/latest/user-guide/block-public-access.html",
        "https://docs.aws.amazon.com/AmazonS3/latest/dev/access-control-block-public-access.html"
    ],
    "dashboard_name": "Buckets",
    "path": "s3.buckets.id",
    "associated_risks": [
        "Data leakage",
        "Unauthorized access"
    ],
    "conditions": [
        "and",
        [
            "s3.buckets.id.public_access_block_configuration.BlockPublicAcls",
            "false",
            ""
        ],
        [
            "s3.buckets.id.public_access_block_configuration.BlockPublicPolicy",
            "false",
            ""
        ],
        [
            "s3.buckets.id.public_access_block_configuration.IgnorePublicAcls",
            "false",
            ""
        ],
        [
            "s3.buckets.id.public_access_block_configuration.RestrictPublicBuckets",
            "false",
            ""
        ]
    ]
}