{
    "description": "Enable Key Vault Recoverability",
    "rationale": "Ensure that production Azure Key Vaults are recoverable in order to prevent permanent deletion/purging of encryption keys, secrets and certificates stored within these vaults. To make your Azure Key Vault instances recoverable, you need to enable both \"Soft Delete\" and \"Do Not Purge\" features:\n\n\"Soft Delete\", implemented by enableSoftDelete parameter, ensures that even if the Key Vault is deleted, the vault itself or its objects (keys, secrets, certificates) remain recoverable for next 90 days. In this span of 90 days, either the vault and its objects can be recovered or purged (permanent deletion). If no action is taken, after 90 days, the Azure Key Vault and all its objects will be purged.\n\n\"Do Not Purge\" feature, implemented by enablePurgeProtection parameter, ensures that the Azure Key Vault and its objects cannot be purged at all, preventing users from accidentally purging Azure Key Vault resources. This adds to the \"Soft Delete\" feature which only ensures that Key Vault is not deleted permanently and will be recoverable for 90 days from the date of deletion.",
    "dashboard_name": "Key Vault",
    "references": [
        "https://www.cloudconformity.com/knowledge-base/azure/KeyVault/sufficient-auto-renewal-period.html",
        "https://docs.microsoft.com/en-us/azure/key-vault/general/about-keys-secrets-certificates",
        "https://docs.microsoft.com/en-us/azure/key-vault/certificates/certificate-scenarios",
    ],
    "display_path": "keyvault.subscriptions.id.vaults.id",
    "path": "keyvault.subscriptions.id.vaults.id",
    "associated_risks": [
        "Data loss"
    ],
    "conditions": [
        "and",
        [
            "keyvault.subscriptions.id.vaults.id.properties.enable_soft_delete",
            "null",
            ""
        ],
        [
            "keyvault.subscriptions.id.vaults.id.properties.enable_purge_protection",
            "null",
            ""
        ]
    ]
}